[{"course_id":"015485","subject":"PMATH","catalog_number":"320","title":"Euclidean Geometry","units":0.5,"description":"Euclid's axioms, triangle centres, conic sections, compass-and-straightedge constructions, isometries of the Euclidean plane and of Euclidean space, regular and star-shaped polygons, tessellations of the Euclidean plane, regular and quasi-regular polyhedra, symmetries of polygons and polyhedra, four-dimensional polytopes, sphere packings, and the kissing problem. Applications.","academic_level":"undergraduate","prerequisites":[1,"MATH106","MATH114","MATH115","MATH136","MATH146","MATH215","NE112"]},{"course_id":"015486","subject":"PMATH","catalog_number":"321","title":"Non-Euclidean Geometry","units":0.5,"description":"An introduction to three types of non-Euclidean geometry: spherical, projective and hyperbolic geometry. Lines, distances, circles, triangles, and areas in these non-Euclidean spaces. Conic sections in the projective plane. Inversions and orthogonal circles. Models of the hyperbolic plane (such as the Poincaré disc model or the upper-half plane model). Tilings of the hyperbolic plane.","academic_level":"undergraduate","prerequisites":[[1,"MATH106","MATH114","MATH115","MATH136","MATH146","MATH215","NE112"],[1,"MATH104","MATH109","MATH116","MATH117","MATH124","MATH127","MATH137","MATH147"]]},{"course_id":"007659","subject":"PMATH","catalog_number":"330","title":"Introduction to Mathematical Logic","units":0.5,"description":"A broad introduction to Mathematical Logic. The notions of logical consequence and derivation are introduced in the settings of propositional and first order logic, with discussions of the completeness theorem and satisfiability.","academic_level":"undergraduate","prerequisites":[1,[[1,"MATH225","MATH126"],[1,"CS116","CS136","CS145"]],"MATH235","MATH245"]},{"course_id":"003323","subject":"PMATH","catalog_number":"331","title":"Applied Real Analysis","units":0.5,"description":"Topology of Euclidean spaces, continuity, norms, completeness. Contraction mapping principle. Fourier series. Various applications, for example, to ordinary differential equations, optimization and numerical approximation.","academic_level":"undergraduate","prerequisites":[1,"MATH237","MATH247"]},{"course_id":"003324","subject":"PMATH","catalog_number":"332","title":"Applied Complex Analysis","units":0.5,"description":"Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.","academic_level":"undergraduate","prerequisites":[1,"MATH237","MATH247"]},{"course_id":"015092","subject":"PMATH","catalog_number":"333","title":"Introduction to Real Analysis","units":0.5,"description":"The purpose of the course is to present the familiar concepts of calculus at a rigorous level and to provide students who took the MATH 137/MATH 138/MATH 237 sequence with the background needed to be successful in PMATH 351 and PMATH 352. Topics discussed include the completeness properties of the reals; the density of the rationals; the topology of real n-dimensional space: open and closed sets, connectedness, compactness (by open covers), the Heine-Borel theorem, completeness; sequences in real n-dimensional space: convergence, Cauchy sequences, subsequences, the Bolzano-Weierstrass theorem; multivariable functions: limits, point-wise and uniform continuity, the extreme value theorem, uniform convergence of sequences of functions, Taylor's theorem, term-by-term differentiation of power series; integration in real n-dimensional space: Riemann integrability, Fubini's theorem for continuous functions on rectangles, term-by-term integration of power series.","academic_level":"undergraduate","prerequisites":["MATH138"]},{"course_id":"007662","subject":"PMATH","catalog_number":"334","title":"Introduction to Rings and Fields with Applications","units":0.5,"description":"Rings, ideals, factor rings, homomorphisms, finite and infinite fields, polynomials and roots, field extensions, algebraic numbers, and applications, for example, to Latin squares, finite geometries, geometrical constructions, error-correcting codes.","academic_level":"undergraduate","prerequisites":[1,"MATH235","MATH245"]},{"course_id":"007663","subject":"PMATH","catalog_number":"336","title":"Introduction to Group Theory with Applications","units":0.5,"description":"Groups, permutation groups, subgroups, homomorphisms, symmetry groups in 2 and 3 dimensions, direct products, Polya-Burnside enumeration.","academic_level":"undergraduate","prerequisites":[1,"MATH235","MATH245"]},{"course_id":"007664","subject":"PMATH","catalog_number":"340","title":"Elementary Number Theory","units":0.5,"description":"An elementary approach to the theory of numbers; the Euclidean algorithm, congruence equations, multiplicative functions, solutions to Diophantine equations, continued fractions, and rational approximations to real numbers.","academic_level":"undergraduate","prerequisites":[1,"MATH225","MATH135","MATH145"]},{"course_id":"007667","subject":"PMATH","catalog_number":"345","title":"Polynomials, Rings and Finite Fields","units":0.5,"description":"Elementary properties of rings, polynomial rings, Gaussian integers, integral domains and fields of fractions, homomorphisms and ideals, maximal ideals and fields, Euclidean rings, principal ideals, Hilbert Basis theorem, Gauss' lemma, Eisenstein's criterion, unique factorization, computational aspects of polynomials, construction of finite fields with applications, primitive roots and polynomials, additional topics. [Offered: F,S]","academic_level":"undergraduate","prerequisites":[1,"MATH235","MATH245"]},{"course_id":"007668","subject":"PMATH","catalog_number":"346","title":"Group Theory","units":0.5,"description":"Elementary properties of groups, cyclic groups, permutation groups, Lagrange's theorem, normal subgroups, homomorphisms, isomorphism theorems and automorphisms, Cayley's theorem and generalizations, class equation, combinatorial applications, p-groups, Sylow theorems, groups of small order, simplicity of the alternating groups, direct product, fundamental structure theorem for finitely generated Abelian groups.","academic_level":"undergraduate","prerequisites":[1,"MATH235","MATH245"]},{"course_id":"014182","subject":"PMATH","catalog_number":"347","title":"Groups and Rings","units":0.5,"description":"Groups, subgroups, homomorphisms and quotient groups, isomorphism theorems, group actions, Cayley and Lagrange theorems, permutation groups and the fundamental theorem of finite abelian groups. Elementary properties of rings, subrings, ideals, homomorphisms and quotients, isomorphism theorems, polynomial rings, and unique factorization domains.","academic_level":"undergraduate","prerequisites":[1,"MATH235","MATH245"]},{"course_id":"014183","subject":"PMATH","catalog_number":"348","title":"Fields and Galois Theory","units":0.5,"description":"Fields, algebraic and transcendental extensions, minimal polynomials, Eisenstein's criterion, splitting fields, and the structure of finite fields. Sylow theorems and solvable groups. Galois theory. The insolvability of the quintic.","academic_level":"undergraduate","prerequisites":["PMATH347"]},{"course_id":"007669","subject":"PMATH","catalog_number":"351","title":"Real Analysis","units":0.5,"description":"Normed and metric spaces, open sets, continuous mappings, sequence and function spaces, completeness, contraction mappings, compactness of metric spaces, finite-dimensional normed spaces, Arzela-Ascoli theorem, existence of solutions of differential equations, Stone-Weierstrass theorem.","academic_level":"undergraduate","prerequisites":[1,"MATH247","PMATH333"]},{"course_id":"007672","subject":"PMATH","catalog_number":"352","title":"Complex Analysis","units":0.5,"description":"Analytic functions, Cauchy-Riemann equations, Goursat's theorem, Cauchy's theorems, Morera's theorem, Liouville's theorem, maximum modulus principle, harmonic functions, Schwarz's lemma, isolated singularities, Laurent series, residue theorem.","academic_level":"undergraduate","prerequisites":[1,"MATH247","PMATH333"]},{"course_id":"007674","subject":"PMATH","catalog_number":"354","title":"Measure Theory and Fourier Analysis","units":0.5,"description":"Lebesgue measure on the line, the Lebesgue integral, monotone and dominated convergence theorems, Lp-spaces: completeness and dense subspaces. Separable Hilbert space, orthonormal bases. Fourier analysis on the circle, Dirichlet kernel, Riemann-Lebesgue lemma, Fejer's theorem and convergence of Fourier series. [Offered: W]","academic_level":"undergraduate","prerequisites":["PMATH351"]},{"course_id":"007675","subject":"PMATH","catalog_number":"360","title":"Geometry","units":0.5,"description":"An introduction to affine, projective and non-Euclidean forms of geometry. Conic sections in the projective plane. Inversion in circles. Theorems of Desargues, Pappus, and Pascal.","academic_level":"undergraduate","prerequisites":[1,"MATH225","MATH235","MATH245"]},{"course_id":"003325","subject":"PMATH","catalog_number":"365","title":"Differential Geometry","units":0.5,"description":"Submanifolds of Euclidean n-space; vector fields and differential forms; integration on submanifolds and Stokes's Theorem; metrics and geodesics; Gauss-Bonnet Theorem.","academic_level":"undergraduate","prerequisites":[[1,"AMATH231","MATH247"],[1,"MATH235","MATH245"]]},{"course_id":"007677","subject":"PMATH","catalog_number":"367","title":"Set Theory & General Topology","units":0.5,"description":"Relations, functions, well-orderings, Schroder-Bernstein theorem, recursion, axiom of choice and equivalents, ordinals, cardinals, continuum hypothesis, singular and inaccessible cardinals. Topological spaces, bases and sub-bases, closure and interior, product spaces, quotient spaces, nets and filters. Hausdorff spaces, completely regular and normal spaces, Urysohn's lemma, Tietze extension theorum. Compactness, Tychonoff's theorum, Stone-Cech compactification. Connectedness, path connectedness, Function spaces.","academic_level":"undergraduate","prerequisites":[1,[1,"AMATH331","PMATH331"],"PMATH351"]},{"course_id":"009496","subject":"PMATH","catalog_number":"370","title":"Chaos and Fractals","units":0.5,"description":"The mathematics of iterated functions, properties of discrete dynamical systems, Mandelbrot and Julia sets.","academic_level":"undergraduate","prerequisites":[[1,"MATH118","MATH119","MATH128","MATH138","MATH148"],[1,"MATH114","MATH115","MATH225","MATH235","MATH245"]]},{"course_id":"007680","subject":"PMATH","catalog_number":"399","title":"Readings in Pure Mathematics","units":0.5,"description":"Reading course as announced by the department.","academic_level":"undergraduate","prerequisites":""},{"course_id":"007687","subject":"PMATH","catalog_number":"432","title":"First Order Logic and Computability","units":0.5,"description":"The concepts of formal provability and logical consequence in first order logic are introduced, and their equivalence is proved in the soundness and completeness theorems. Goedel's incompleteness theorem is discussed, making use of the halting problem of computability theory. Relative computability and the Turing degrees are further studied.","academic_level":"undergraduate","prerequisites":[1,"PMATH345","PMATH346","PMATH347"]},{"course_id":"012623","subject":"PMATH","catalog_number":"433","title":"Model Theory and Set Theory","units":0.5,"description":"Model theory: the semantics of first order logic including the compactness theorem and its consequences, elementary embeddings and equivalence, the theory of definable sets and types, quantifier elimination, and omega-stability. Set theory: well-orderings, ordinals, cardinals, Zermelo-Fraenkel axioms, axiom of choice, informal discussion of classes and independence results.","academic_level":"undergraduate","prerequisites":[1,"PMATH345","PMATH346","PMATH347"]},{"course_id":"012236","subject":"PMATH","catalog_number":"434","title":"Techniques in Computational Number Theory","units":0.5,"description":"An introduction to: integer factorization, elliptic curves methods, primality testing, fast integer arithmetic, fast Fourier transforms and quantum computing. This course is taught with a philosophy that encourages experimentation.","academic_level":"undergraduate","prerequisites":[1,[1,"CM339","CS341"],"PMATH334","PMATH336","PMATH345","PMATH346"]},{"course_id":"007690","subject":"PMATH","catalog_number":"440","title":"Analytic Number Theory","units":0.5,"description":"Summation methods, analytic theory of the Riemann zeta function, Prime Number Theorem, primitive roots, quadratic reciprocity. Dirichlet characters and infinitude of primes in arithmetic progressions, and assorted topics.","academic_level":"undergraduate","prerequisites":[1,"PMATH352",[1,"AMATH332","PMATH332"]]},{"course_id":"007691","subject":"PMATH","catalog_number":"441","title":"Algebraic Number Theory","units":0.5,"description":"An introduction to algebraic number theory; unique factorization, Dedekind domains, class numbers, Dirichlet's unit theorem, solutions of Diophantine equations.","academic_level":"undergraduate","prerequisites":[1,"PMATH345","PMATH348"]},{"course_id":"007692","subject":"PMATH","catalog_number":"442","title":"Fields and Galois Theory","units":0.5,"description":"Normal series, elementary properties of solvable groups and simple groups, algebraic and transcendental extensions of fields, adjoining roots, splitting fields, geometric constructions, separability, normal extensions, Galois groups, fundamental theorem of Galois theory, solvability by radicals, Galois groups of equations, cyclotomic and Kummer extensions.","academic_level":"undergraduate","prerequisites":["PMATH345","PMATH346"]},{"course_id":"007694","subject":"PMATH","catalog_number":"444","title":"Rings, Modules, and Representations","units":0.5,"description":"Jacobson structure theory, density theorem, Jacobson radical, Maschke's theorem. Artinian rings, Artin-Wedderburn theorem, modules over semi-simple Artinian rings. Division rings. Representations of finite groups.","academic_level":"undergraduate","prerequisites":["PMATH345"]},{"course_id":"014184","subject":"PMATH","catalog_number":"445","title":"Representations of Finite Groups","units":0.5,"description":"Basic definitions and examples: subrepresentations and irreducible representations, tensor products of representations. Character theory. Representations as modules over the group ring, Artin-Wedderburn structure theorem for semisimple rings. Induced representations, Frobenius reciprocity, Mackey's irreducibility criterion.","academic_level":"undergraduate","prerequisites":[1,["PMATH345","PMATH346"],"PMATH347"]},{"course_id":"014185","subject":"PMATH","catalog_number":"446","title":"Introduction to Commutative Algebra","units":0.5,"description":"Module theory: classification of finitely generated modules over PIDs, exact sequences and tensor products, algebras, localisation, chain conditions. Primary decomposition, integral extensions, Noether's normalisation lemma, and Hilbert's Nullstellensatz.","academic_level":"undergraduate","prerequisites":[1,"PMATH345","PMATH347"]},{"course_id":"007674","subject":"PMATH","catalog_number":"450","title":"Lebesgue Integration and Fourier Analysis","units":0.5,"description":"Lebesgue measure on the line, the Lebesgue integral, monotone and dominated convergence theorems, Lp-spaces: completeness and dense subspaces. Separable Hilbert space, orthonormal bases. Fourier analysis on the circle, Dirichlet kernel, Riemann-Lebesgue lemma, Fejer's theorem and convergence of Fourier series.","academic_level":"undergraduate","prerequisites":["PMATH351"]},{"course_id":"003348","subject":"PMATH","catalog_number":"451","title":"Measure and Integration","units":0.5,"description":"General measures, measurability, Caratheodory Extension theorem and construction of measures, integration theory, convergence theorems, Lp-spaces, absolute continuity, differentiation of monotone functions, Radon-Nikodym theorem, product measures, Fubini's theorem, signed measures, Urysohn's lemma, Riesz Representation theorems for classical Banach spaces.","academic_level":"undergraduate","prerequisites":[1,"PMATH354","PMATH450"]},{"course_id":"003349","subject":"PMATH","catalog_number":"453","title":"Functional Analysis","units":0.5,"description":"Banach and Hilbert spaces, bounded linear maps, Hahn-Banach theorem, open mapping theorem, closed graph theorem, topologies, nets, Hausdorff spaces, Tietze extension theorem, dual spaces, weak topologies, Tychonoff's theorem, Banach-Alaoglu theorem, reflexive spaces.","academic_level":"undergraduate","prerequisites":[1,"PMATH354","PMATH450"]},{"course_id":"010733","subject":"PMATH","catalog_number":"464","title":"Introduction to Algebraic Geometry","units":0.5,"description":"An introduction to algebraic geometry through the theory of algebraic\r\ncurves. General Algebraic Geometry: affine and projective algebraic sets,\r\nHilbert's Nullstellensatz, co-ordinate rings, polynomial maps, rational\r\nfunctions and local rings. Algebraic Curves: affine and projective plane\r\ncurves, tangency and multiplicity, intersection numbers, Bezout's theorem\r\nand divisor class groups.","academic_level":"undergraduate","prerequisites":[1,"PMATH345","PMATH347"]},{"course_id":"003350","subject":"PMATH","catalog_number":"465","title":"Geometry of Manifolds","units":0.5,"description":"Point-set topology; smooth manifolds, smooth maps and tangent vectors; the tangent bundle; vector fields, tensor fields and differential forms. Other topics may include: de Rham cohomology; Frobenius Theorem; Riemannian metrics, connections and curvature.","academic_level":"undergraduate","prerequisites":["PMATH365"]},{"course_id":"007704","subject":"PMATH","catalog_number":"467","title":"Algebraic Topology","units":0.5,"description":"Topological spaces and topological manifolds; quotient spaces; cut and paste constructions; classification of two-dimensional manifolds; fundamental group; homology groups. Additional topics may include: covering spaces; homotopy theory; selected applications to knots and combinatorial group theory.","academic_level":"undergraduate","prerequisites":[[1,"PMATH346","PMATH347"],[1,"PMATH351","PMATH367"]]},{"course_id":"007706","subject":"PMATH","catalog_number":"499","title":"Readings in Pure Mathematics","units":0.5,"description":"Reading course as announced by the department.","academic_level":"undergraduate","prerequisites":""},{"course_id":"002339","subject":"PMATH","catalog_number":"632","title":"First Order Logic and Computability","units":0.5,"description":"The concepts of formal provability and logical consequence in first order logic are introduced, and their equivalence is proved in the soundness and completeness theorems.  Goedel's incompleteness theorem is discussed; making use of the halting problem of computability theory.  Relative computability and the Turing degrees are further studied.","academic_level":"graduate","prerequisites":[1,"PMATH345","PMATH346"]},{"course_id":"002341","subject":"PMATH","catalog_number":"641","title":"Algebraic Number Theory","units":0.5,"description":"An introduction to algebraic number theory; unique factorization, Dedekind domains, class numbers, Dirichlet's unit theorem, solutions of Diophantine equations.","academic_level":"graduate","prerequisites":["PMATH345"]},{"course_id":"002342","subject":"PMATH","catalog_number":"642","title":"Fields and Galois Theory","units":0.5,"description":"Normal series, elementary properties of solvable groups and simple groups, algebraic and transcendental extensions of fields, adjoining roots, splitting fields, geometric constructions, separability, normal extensions, Galois groups, fundamental theorem of Galois theory, solvability by radicals, Galois groups of equations, cyclotomic and Kummer extensions. Students without the required prerequisite may seek consent of the department.","academic_level":"graduate","prerequisites":["PMATH345","PMATH346"]},{"course_id":"002343","subject":"PMATH","catalog_number":"644","title":"Rings, Modules and Representations","units":0.5,"description":"Jacobson structure theory, density theorem, Jacobson radical, Maschke's theorem.  Artinian rings, Artin-Wedderburn theorem, modules over semi-simple Artinian rings.  Division rings.  Representations of finite groups.  Finitely generated modules over principal ideal domains.   Students without the required prerequisite may seek consent of the department.","academic_level":"graduate","prerequisites":["PMATH345","PMATH346"]},{"course_id":"014670","subject":"PMATH","catalog_number":"646","title":"Introduction to Commutative Algebra","units":0.5,"description":"Module theory:  classification of finitely generated modules over PIDs, exact sequences and tensor products, algebras, localisation, chain conditions.  Primary decomposition, integral extensions, Noether's normalisation lemma, and Hilbert's Nullstellensatz.","academic_level":"graduate","prerequisites":["PMATH347","PMATH348"]},{"course_id":"013667","subject":"PMATH","catalog_number":"650","title":"Lebesgue Integration and Fourier Analysis","units":0.5,"description":"Lebesgue measure on the line, the Lebesgue integral, monotone and dominated convergence theorems, LP spaces, completeness and dense subspaces; separable Hilbert space, orthonormal bases; Fourier analysis on the circle, Dirichlet kernel, Riemann-Lebesgue lemma, Fejer's theorem and convergence of Fourier series.","academic_level":"graduate","prerequisites":["PMATH351"]},{"course_id":"002346","subject":"PMATH","catalog_number":"651","title":"Measure and Integration","units":0.5,"description":"General measures, measurability, Caratheodory extension theorem and construction of measures, integration theory, convergence theorems, LP spaces, absolute continuity, differentiation of monotone functions, Radon-Nikodym theorem, product measures, Fubini's theorem, signed measures, Urysohn's lemma, Riesz Representation theorems for classical Banach spaces.","academic_level":"graduate","prerequisites":[1,"PMATH354","PMATH450"]},{"course_id":"002347","subject":"PMATH","catalog_number":"652","title":"Topics in Complex Analysis","units":0.5,"description":"The Riemann mapping theorem and several topics such as analytic continuation, harmonic functions, elliptic functions, entire functions, univalent functions, special functions. Students without the required prerequisite may seek consent of the department.","academic_level":"graduate","prerequisites":["PMATH352"]},{"course_id":"002349","subject":"PMATH","catalog_number":"665","title":"Geometry of Manifolds","units":0.5,"description":"Point-set topology; smooth manifolds, smooth maps, and tangent vectors; the tangent bundle, vector fields, tensor fields, and differential forms. Other topics may include: de Rham cohomology; Frobenius Theorem; Riemannian metrics, connections and curvature.","academic_level":"graduate","prerequisites":[1,"PMATH365","AM333"]},{"course_id":"002350","subject":"PMATH","catalog_number":"667","title":"Algebraic Topology","units":0.5,"description":"Topological spaces and topological manifolds; quotient spaces; cut and paste constructions; classification of two-dimensional manifolds; fundamental group; homology groups. Additional topics may include: covering spaces; homotopy theory; selected applications to knots and combinatorial group theory.","academic_level":"graduate","prerequisites":["PMATH351"]},{"course_id":"002351","subject":"PMATH","catalog_number":"690","title":"Literature and Research Studies","units":0.5,"description":"Reading Course","academic_level":"graduate"},{"course_id":"011873","subject":"PMATH","catalog_number":"701","title":"Graduate Algebra","units":0.5,"description":"Isomorphism theorems, classical structures theorems for finite groups, nilpotent and solvable groups, free groups, presentation modules over Principal Ideal Domains (PIDs), Hilbert Basis Theorem, Groebner bases, Artin-Wedderbury Theorem, field extensions, decompositions, claculation of Galois groups.","academic_level":"graduate"},{"course_id":"011874","subject":"PMATH","catalog_number":"702","title":"Graduate Analysis","units":0.5,"description":"Zorn's Lemma and the Axiom of Choice, cardinality, introduction to topological spaces, bases, nets, continuous functions and weak topologies, compactness, connectedness, Banach spaces, Contraction Mapping Principal, finite-dimensional spaces C(X) and C_O(X), Stone-Weierstrass Theorem, Arzela-Ascoli Theorem, Urysohn's Lemma, idelas in C_O(X).","academic_level":"graduate"},{"course_id":"013668","subject":"PMATH","catalog_number":"733","title":"Model Theory and Set Theory","units":0.5,"description":"Model theory: the semantics of first order logic including the compactness theorem and its consequences, elementary embedding and equivalence, the theory of definable sets and types, quantifier elimination, and w-stability.  Set theory: well-orderings, ordinals, cardinals, Zermelo-Fraenkel axioms, axiom of choice, informal discussion of classes and independence results.","academic_level":"graduate"},{"course_id":"013669","subject":"PMATH","catalog_number":"740","title":"Analytic Number Theory","units":0.5,"description":"Summation methods; analytic theory of the Riemann zeta function; Prime Number Theorem; primitive roots; quadratic reciprocity; Dirichlet characters and infinitude of primes in arithmetic progressions; assorted topics.","academic_level":"graduate","prerequisites":[1,"PMATH332","PMATH352"]},{"course_id":"014343","subject":"PMATH","catalog_number":"745","title":"Representations of Finite Groups","units":0.5,"description":"Basic definitions and examples: subrepresentations and irreducible representations, tensor products of representations.  Character theory.  Representations as modules over the group ring, Artin-Wedderburn structure theorem for semisimple rings.  Induced representations, Frobenius reciprocity, Mackeys irreducibility criterion.","academic_level":"graduate","prerequisites":["PMATH347"]},{"course_id":"013670","subject":"PMATH","catalog_number":"753","title":"Functional Analysis","units":0.5,"description":"Banach and Hilbert spaces, bounded linear maps, Hahn-Banach theorem, open mapping theorem, closed graph theorem, topologies, nets, Hausdorff spaces, Tietze extension theorem, dual spaces, weak topologies, Tychonoff's theorem, Banach-Alaoglu theorem, reflexive spaces.","academic_level":"graduate","prerequisites":[1,"PMATH354","PMATH450"]},{"course_id":"002391","subject":"PMATH","catalog_number":"763","title":"Introduction to Lie Groups and Lie Algebras","units":0.5,"description":"An introduction to matrix Lie groups and their associated Lie algebras: geometry of matrix Lie groups; relations between a matrix Lie group and its Lie algebra; representation theory of matrix Lie groups.","academic_level":"graduate","prerequisites":["PMATH346","PMATH351","PMATH365"]},{"course_id":"002392","subject":"PMATH","catalog_number":"764","title":"Introduction to Algebraic Geometry","units":0.5,"description":"An introduction to algebraic geometry through the theory of algebraic curves.  General algebraic geometry:  affine and projective algebraic sets, Hilbert's Nullstellensatz, co-ordinate rings, polynomial maps, rational functions and local rings.  Algebraic curves: affine and projective plane curves, tangency and multiplicity, intersection numbers, Bezout's theorem and divisor class groups.","academic_level":"graduate"},{"course_id":"010486","subject":"PMATH","catalog_number":"800","title":"Topics in Real and Complex Analysis","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"011875","subject":"PMATH","catalog_number":"810","title":"Banach Algebras and Operator Theory","units":0.5,"description":"Banach algebras, functional calculus, Gelfan transform, Jacobson radical, Banach space and Hilbert space operators, Fredholm alternative, spectral therorem for compact normal operators, ideals in C^*-algebras, linear functionals and states, Gelfand-Naimark-Segar (GNS) construction, von Neumann algebras, strong/weak operator topologies, Double Commutant theorem, Kaplansky's density theorem, spectral theorem for normal operators.","academic_level":"graduate","prerequisites":["PMATH753"]},{"course_id":"010487","subject":"PMATH","catalog_number":"811","title":"Topics in Functional Analysis","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"002408","subject":"PMATH","catalog_number":"822","title":"Topics in Operator Theory","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"002412","subject":"PMATH","catalog_number":"833","title":"Topics in Harmonic Analysis","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"002414","subject":"PMATH","catalog_number":"844","title":"Topics in Functional Equations","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"010483","subject":"PMATH","catalog_number":"900","title":"Topics in Algebra","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"010484","subject":"PMATH","catalog_number":"911","title":"Topics in Mathematical Logic","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"002366","subject":"PMATH","catalog_number":"922","title":"Topics in Universal Algebra","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"014769","subject":"PMATH","catalog_number":"930","title":"Topics in Logic","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"002377","subject":"PMATH","catalog_number":"933","title":"Topics in Group Theory","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"014770","subject":"PMATH","catalog_number":"940","title":"Topics in Number Theory","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"002383","subject":"PMATH","catalog_number":"944","title":"Topics in Number Theory","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"014771","subject":"PMATH","catalog_number":"945","title":"Topics in Algebra","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"014772","subject":"PMATH","catalog_number":"950","title":"Topics in Analysis","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"002388","subject":"PMATH","catalog_number":"955","title":"Topics in Geometry","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"014773","subject":"PMATH","catalog_number":"965","title":"Topics in Gemetry and Topology","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"010485","subject":"PMATH","catalog_number":"966","title":"Topics in Topology","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"014774","subject":"PMATH","catalog_number":"990","title":"Topics in Pure Mathematics","units":0.5,"description":"","academic_level":"graduate"}]