[{"course_id":"008859","subject":"STAT","catalog_number":"202","title":"Introductory Statistics for Scientists","units":0.5,"description":"Elementary probability, populations, samples and distributions with biological examples. Methods for data summary and presentation. Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation. [Offered: F,W]","academic_level":"undergraduate","prerequisites":""},{"course_id":"010128","subject":"STAT","catalog_number":"206","title":"Statistics for Software Engineering","units":0.5,"description":"Empirical problem solving with applications to software engineering. An introduction to probability theory. An introduction to distribution theory and to methods of statistical inference, including confidence intervals and hypothesis testing. An introduction to regression. [Offered: F]","academic_level":"undergraduate","prerequisites":["MATH115","MATH119"]},{"course_id":"008861","subject":"STAT","catalog_number":"211","title":"Introductory Statistics and Sampling for Accounting","units":0.5,"description":"Descriptive statistics, probability, discrete and continuous random variables. Sampling distributions and simple hypothesis testing. Introduction to survey sampling. [Offered: W]","academic_level":"undergraduate","prerequisites":["MATH109"]},{"course_id":"008862","subject":"STAT","catalog_number":"220","title":"Probability (Non-Specialist Level)","units":0.5,"description":"The laws of probability, discrete and continuous random variables, expectation, central limit theorem. [Offered: F,W]","academic_level":"undergraduate","prerequisites":[1,"MATH119","MATH128","MATH138","MATH148"]},{"course_id":"008863","subject":"STAT","catalog_number":"221","title":"Statistics (Non-Specialist Level)","units":0.5,"description":"Empirical problem solving, measurement systems, causal relationships, statistical models, estimation, confidence intervals, tests of significance. [Offered: F, W]","academic_level":"undergraduate","prerequisites":[[1,"MATH128","MATH138","MATH148"],[1,"STAT220","STAT230","STAT240"]]},{"course_id":"008864","subject":"STAT","catalog_number":"230","title":"Probability","units":0.5,"description":"This course provides an introduction to probability models including sample spaces, mutually exclusive and independent events, conditional probability and Bayes' Theorem. The named distributions (Discrete Uniform, Hypergeometric, Binomial, Negative Binomial, Geometric, Poisson, Continuous Uniform, Exponential, Normal (Gaussian), and Multinomial) are used to model real phenomena. Discrete and continuous univariate random variables and their distributions are discussed. Joint probability functions, marginal probability functions, and conditional probability functions of two or more discrete random variables and functions of random variables are also discussed. Students learn how to calculate and interpret means, variances and covariances particularly for the named distributions. The Central Limit Theorem is used to approximate probabilities.","academic_level":"undergraduate","prerequisites":[[1,"MATH135","MATH145"],[1,"MATH128","MATH117"]]},{"course_id":"008865","subject":"STAT","catalog_number":"231","title":"Statistics","units":0.5,"description":"This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded. The connection between the attributes of a population and the parameters in the named distributions covered in STAT 230 will be emphasized. Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed. The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses. The interpretation of confidence intervals and p-values will be emphasized. The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests. Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.","academic_level":"undergraduate","prerequisites":[[1,"MATH119","MATH128","MATH138","MATH148"],[1,"STAT220","STAT230","STAT240"]]},{"course_id":"013320","subject":"STAT","catalog_number":"232","title":"Introduction to Medical Statistics","units":0.5,"description":"This course will provide an introduction to statistical methods in health research. Topics to be covered include types of medical data, measures of disease prevalence and incidence, age and sex adjustment of disease rates, sensitivity and specificity of diagnostic tests, ROC curves, measures of association between risk factors and disease, major sources of medical data in the Canadian context including surveys, registries, and clinical studies such as cohort studies, clinical trials and case-control studies. Papers from the medical literature will be used throughout to illustrate the concepts. Introduction to SAS for data analysis and an introduction to database management tools. [Offered: F]","academic_level":"undergraduate"},{"course_id":"008866","subject":"STAT","catalog_number":"240","title":"Probability (Advanced Level)","units":0.5,"description":"STAT 240 is an advanced-level enriched version of STAT 230.","academic_level":"undergraduate","prerequisites":[1,"MATH137","MATH147"]},{"course_id":"008867","subject":"STAT","catalog_number":"241","title":"Statistics (Advanced Level)","units":0.5,"description":"STAT 241 is an advanced-level enriched version of STAT 231.","academic_level":"undergraduate","prerequisites":[[1,"MATH138","MATH148"],[1,"STAT230","STAT240"]]},{"course_id":"004384","subject":"STAT","catalog_number":"316","title":"Introduction to Statistical Problem Solving by Computer","units":0.5,"description":"This is an applications oriented course which prepares the nonmathematical student to use the computer as a research tool. Topics include aids for statistical analysis and the preparation of documents such as reports and theses. The course provides sufficient background for application to other problems specific to the individual's field. [Offered: W]","academic_level":"undergraduate","prerequisites":[1,"ECON221","ENVS278","HLTH204",[1,"ISS250","SDS250R"],"KIN222",[1,"PSCI214","PSCI314"],"PSYCH292","REC371",[1,"SOC280","LS280"]]},{"course_id":"008870","subject":"STAT","catalog_number":"321","title":"Regression and Forecasting (Non-Specialist Level)","units":0.5,"description":"Modeling the relationship between a response variable and several explanatory variables via regression models. Model diagnostics and improvement. Using regression models for forecasting, Exponential smoothing. Simple time series modeling. [Offered: W]","academic_level":"undergraduate","prerequisites":[[1,"MATH225","MATH235","MATH245"],[1,"STAT221","STAT231","STAT241"]]},{"course_id":"008871","subject":"STAT","catalog_number":"322","title":"Sampling and Experimental Design (Non-Specialist Level)","units":0.5,"description":"Planning sample surveys; simple random sampling; stratified sampling. Observational and experimental studies. Blocking, randomization, factorial designs. Analysis of variance. Applications of design principles. [Offered: F]","academic_level":"undergraduate","prerequisites":[1,"STAT221","STAT231","STAT241"]},{"course_id":"008872","subject":"STAT","catalog_number":"330","title":"Mathematical Statistics","units":0.5,"description":"This course provides a mathematically rigorous treatment for topics covered in STAT 230 and 231, and to make essential extensions to the multivariate case. Maximum likelihood estimation. Random variables and distribution theory. Generating functions. Functions of random variables. Limiting distributions. Large sample theory of likelihood methods. Likelihood ratio tests. \r\nJoint probability (density) functions, marginal probability (density) functions, and conditional probability (density) functions of two or more random variables are discussed. Topics covered include independence of random variables, conditional expectation and the determination of the distribution of functions of random variables using the cumulative distribution method, change of variable and moment generating functions. Properties of the Multinomial and Bivariate Normal distributions are proved. Limiting distributions, including convergence in probability and convergence in distribution, are discussed. Important results, including the Weak Law of Large Numbers, Central Limit Theorem, Slutsky's theorem, and the Delta Method, are introduced with applications. The maximum likelihood method is discussed for the multi-parameter case. Asymptotic properties of the maximum likelihood estimator are examined and used to construct confidence intervals or regions. Tests for simple and composite hypotheses are constructed using the Likelihood Ratio Test. [Offered: F,W,S]","academic_level":"undergraduate","prerequisites":[[1,"MATH237","MATH247"],[1,"STAT230","STAT240"],[1,"STAT231","STAT241"]]},{"course_id":"008873","subject":"STAT","catalog_number":"331","title":"Applied Linear Models","units":0.5,"description":"Modeling the relationship between a response variable and several explanatory variables (an output-input system) via regression models. Least squares algorithm for estimation of parameters. Hypothesis testing and prediction. Model diagnostics and improvement. Algorithms for variable selection. Nonlinear regression and other methods. [Offered: F,W,S]","academic_level":"undergraduate","prerequisites":[[1,"MATH235","MATH245"],[1,"STAT231","STAT241","SYDE212"]]},{"course_id":"008874","subject":"STAT","catalog_number":"332","title":"Sampling and Experimental Design","units":0.5,"description":"Designing sample surveys. Probability sampling designs. Estimation with elementary designs. Observational and experimental studies. Blocking, randomization, factorial designs. Analysis of variance. Designing for comparison of groups. [Offered: F,W,S]","academic_level":"undergraduate","prerequisites":[1,"STAT231","STAT241","SYDE212"]},{"course_id":"008875","subject":"STAT","catalog_number":"333","title":"Applied Probability","units":0.5,"description":"Review of basic probability. Generating functions. Theory of recurrent events. Markov chains, Markov processes, and their applications. [Offered: F,W,S]","academic_level":"undergraduate","prerequisites":[1,"STAT230","STAT240"]},{"course_id":"012662","subject":"STAT","catalog_number":"334","title":"Probability Models for Business and Accounting","units":0.5,"description":"Random variables and distribution theory, conditional expectations, moment and probability generating functions, change of variables, random walks, Markov chains, Markov processes. [Offered F,S]","academic_level":"undergraduate","prerequisites":[[1,"MATH237","MATH247"],[1,"STAT230","STAT240"],[1,"STAT231","STAT241"]]},{"course_id":"013320","subject":"STAT","catalog_number":"337","title":"Introduction to Medical Statistics","units":0.5,"description":"This course will provide an introduction to statistical methods in health research. Topics to be covered include types of medical data, measures of disease prevalence and incidence, age and sex adjustment of disease rates, sensitivity and specificity of diagnostic tests, ROC curves, measures of association between risk factors and disease, major sources of medical data in the Canadian context including surveys, registries, and clinical studies such as cohort studies, clinical trials and case-control studies. Papers from the medical literature will be used throughout to illustrate the concepts. Introduction to SAS for data analysis and an introduction to database management tools. [Offered: F]","academic_level":"undergraduate","prerequisites":[1,"STAT221","STAT231","STAT241"]},{"course_id":"004408","subject":"STAT","catalog_number":"340","title":"Computer Simulation of Complex Systems","units":0.5,"description":"Building and validation of stochastic simulation models useful in computing, operations research, engineering and science. Related design and estimation problems. Variance reduction. The implementation and the analysis of the results. [Offered: W,S]","academic_level":"undergraduate","prerequisites":[[1,"CS116",[1,"CS126","CS124"],"CS134","CS136","CS138","CS145",[1,"SYDE221","SYDE322"]],[1,"STAT230","STAT240"],[1,"STAT231","STAT241"]]},{"course_id":"011431","subject":"STAT","catalog_number":"341","title":"Computational Statistics and Data Analysis","units":0.5,"description":"Approximation and optimization of noisy functions. Simulation from univariate and multivariate distributions, multivariate normal distribution, mixture distributions and introduction to Markov Monte Carlo. Introduction to supervised statistical learning including discrimination methods. [Offered: F]","academic_level":"undergraduate","prerequisites":[[1,"MATH237","MATH247"],[1,"STAT230","STAT240"],[1,"STAT231","STAT241"]]},{"course_id":"011723","subject":"STAT","catalog_number":"371","title":"Applied Linear Models and Process Improvement for Business","units":0.5,"description":"Practical and theoretical aspects of simple and multiple linear regression models. Model building, fitting and assessment. Process thinking and improvement. Strategies for variation reduction such as control charting. Process monitoring, control and adjustment. Applications to problems in business. [Offered: F,W,S]","academic_level":"undergraduate","prerequisites":[[1,"MATH235","MATH245"],[1,"STAT231","STAT241"]]},{"course_id":"011724","subject":"STAT","catalog_number":"372","title":"Survey Sampling and Experimental Design Techniques for Business","units":0.5,"description":"Design and analysis of surveys. Management of sample and non-sample error. Simple random sampling and stratified random sampling. Additional topics in survey sampling. Observational and experimental studies. Principles for the design of experiments. Analysis of Variance, factorial experiments and interaction. Application to problems in business. [Offered: F,W,S]","academic_level":"undergraduate","prerequisites":[1,"STAT231","STAT241"]},{"course_id":"012225","subject":"STAT","catalog_number":"373","title":"Regression and Forecasting Methods in Finance","units":0.5,"description":"Application of regression and time series models in finance; multiple regression; algebraic and geometric representation of least squares; inference methods - confidence intervals and hypothesis tests, ANOVA, prediction; model building and assessment; time series modeling; autoregressive AR(1) models - fitting, assessment and prediction; moving average smoothing, seasonal adjustment; non-stationarity and differencing. [Offered: F]","academic_level":"undergraduate","prerequisites":["MATH136",[1,"STAT231","STAT241"]]},{"course_id":"008880","subject":"STAT","catalog_number":"430","title":"Experimental Design","units":0.5,"description":"Review of experimental designs in a regression setting; analysis of variance; replication, balance, blocking, randomization, and interaction; one-way layout, two-way layout, and Latin square as special cases; factorial structure of treatments; covariates; treatment contrasts; two-level fractional factorial designs; fixed versus random effects; split-plot and repeated-measures designs; other topics. [Offered: F,S]","academic_level":"undergraduate","prerequisites":[[1,"STAT331","STAT371"],[1,"STAT332","STAT372"]]},{"course_id":"008881","subject":"STAT","catalog_number":"431","title":"Generalized Linear Models and their Applications","units":0.5,"description":"Review of the normal linear model and maximum likelihood estimation; regression models for binomial, Poisson and multinomial data; generalized linear models; and other topics in regression modelling. [Offered: F,W,S]","academic_level":"undergraduate","prerequisites":["STAT330",[1,"STAT371"]]},{"course_id":"008882","subject":"STAT","catalog_number":"433","title":"Stochastic Processes","units":0.5,"description":"Point processes. Renewal theory. Stationary processes. Selected topics. [Offered: F]","academic_level":"undergraduate","prerequisites":["STAT333"]},{"course_id":"011042","subject":"STAT","catalog_number":"435","title":"Statistical Methods for Process Improvements","units":0.5,"description":"Statistical methods for improving processes based on observational data. Assessment of measurement systems. Strategies for variation reduction. Process monitoring, control and adjustment. Clue generation techniques for determining the sources of variability. Variation transmission. [Offered: W]","academic_level":"undergraduate","prerequisites":[1,"STAT332","STAT372"]},{"course_id":"013322","subject":"STAT","catalog_number":"436","title":"Introduction to the Analysis of Spatial Data in Health Research","units":0.5,"description":"The objective of this course is to develop understanding and working knowledge of spatial models and analysis of spatial data. The course provides an introduction to the rudiments of statistical inference based on spatially correlated data. Methods of estimation and testing will be developed for geostatistical models based on variograms and spatial autogressive models. Concepts and application of methods will be emphasized through case studies and projects with health applications. [Offered: W]","academic_level":"undergraduate","prerequisites":["STAT431"]},{"course_id":"013321","subject":"STAT","catalog_number":"437","title":"Analysis of Longitudinal Data in Health Research","units":0.5,"description":"This course will provide an introduction to the principles and methods for the analysis of longitudinal data. Conditional and random effect modeling approaches to regression analysis will be covered, as well as semiparametric methods based on generalized estimating equations. Supporting statistical theory will be given at a level appropriate for a senior undergraduate student in Statistics. The importance of model assessment and parameter interpretation will be emphasized. Problems will be motivated by applications in epidemiology, clinical medicine, health services research, and disease natural history studies. Students will be required to think critically about appropriate strategies for data analysis. Analysis will be carried out with SAS and S-PLUS/R software and the importance of providing clear interpretations to data analyses will be emphasized. [Offered: W]","academic_level":"undergraduate","prerequisites":["STAT431"]},{"course_id":"008883","subject":"STAT","catalog_number":"440","title":"Computational Inference","units":0.5,"description":"Introduction to and application of computational methods in statistical inference. Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques including EM. Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods. [Offered: W]","academic_level":"undergraduate","prerequisites":[1,"STAT341",[1,"CS437","STAT340"]]},{"course_id":"008884","subject":"STAT","catalog_number":"441","title":"Statistical Learning - Classification","units":0.5,"description":"Given known group membership, methods which learn from data how to classify objects into the groups are treated. Review of likelihood and posterior based discrimination. Main topics include logistic regression, neural networks, tree-based methods and nearest neighbour methods. Model assessment, training and tuning. [Offered: F]","academic_level":"undergraduate","prerequisites":[1,"STAT341",["STAT330","STAT340"]]},{"course_id":"011434","subject":"STAT","catalog_number":"442","title":"Data Visualization","units":0.5,"description":"Visualization of high dimensional data including interactive methods directed at exploration and assessment of structure and dependencies in data. Methods for finding groups in data including traditional and modern methods of cluster analysis. Dimension reduction methods including multi-dimensional scaling, nonlinear and other methods. [Offered: F]","academic_level":"undergraduate","prerequisites":[1,"STAT231","STAT241"]},{"course_id":"008885","subject":"STAT","catalog_number":"443","title":"Forecasting","units":0.5,"description":"Model building. Multiple regression and forecasting. Exponential smoothing. Box-Jenkins models. Smoothing of seasonal data. [Offered: F,W,S]","academic_level":"undergraduate","prerequisites":[1,"STAT331","STAT371","SYDE334"]},{"course_id":"011436","subject":"STAT","catalog_number":"444","title":"Statistical Learning - Function Estimation","units":0.5,"description":"Methods for finding surfaces in high dimensions from incomplete or noisy functional information. Both data adaptive and methods based on fixed parametric structure will be treated. Model assessment, training and tuning. [Offered: W]","academic_level":"undergraduate","prerequisites":[1,"STAT341","STAT331","STAT371"]},{"course_id":"003305","subject":"STAT","catalog_number":"446","title":"Mathematical Models in Finance","units":0.5,"description":"Mathematical techniques used to price and hedge derivative securities in modern finance. Modelling, analysis and computations for financial derivative products, including exotic options and swaps in all asset classes. Applications of derivatives in practice. [Offered: F,W]","academic_level":"undergraduate","prerequisites":[[1,[1,"AFM372","ACTSC391"],"ACTSC231","ACTSC231BUS"],[1,"STAT333","STAT334"]]},{"course_id":"008888","subject":"STAT","catalog_number":"450","title":"Estimation and Hypothesis Testing","units":0.5,"description":"Discussion of inference problems under the headings of hypothesis testing and point and interval estimation. Frequentist and Bayesian approaches to inference. Construction and evaluation of tests and estimators. Large sample theory of point estimation. [Offered: W]","academic_level":"undergraduate","prerequisites":["STAT330"]},{"course_id":"008890","subject":"STAT","catalog_number":"454","title":"Sampling Theory and Practice","units":0.5,"description":"Sources of survey error. Probability sampling designs, estimation and efficiency comparisons. Distribution theory and confidence intervals. Generalized regression estimation. Software for survey analysis. [Offered: W]","academic_level":"undergraduate","prerequisites":[1,"STAT332","STAT372"]},{"course_id":"008891","subject":"STAT","catalog_number":"464","title":"Topics in Probability Theory","units":0.5,"description":"Special Topics course as announced by the department.","academic_level":"undergraduate","prerequisites":["STAT333"]},{"course_id":"008892","subject":"STAT","catalog_number":"466","title":"Topics in Statistics 1","units":0.5,"description":"Special Topics course as announced by the department.","academic_level":"undergraduate","prerequisites":["STAT330","STAT331"]},{"course_id":"008893","subject":"STAT","catalog_number":"467","title":"Topics in Statistics 2","units":0.5,"description":"Special Topics course as announced by the department.","academic_level":"undergraduate","prerequisites":""},{"course_id":"008894","subject":"STAT","catalog_number":"468","title":"Readings in Statistics 1","units":0.5,"description":"Reading course as announced by the department.","academic_level":"undergraduate","prerequisites":""},{"course_id":"010728","subject":"STAT","catalog_number":"469","title":"Readings in Statistics 2","units":0.5,"description":"Reading course as announced by the department.","academic_level":"undergraduate","prerequisites":""},{"course_id":"013825","subject":"STAT","catalog_number":"631","title":"Introduction to Statistical Methods in Health Informatics","units":0.5,"description":"Exploratory data analysis and data visualization.  Confounding, censoring, selection bias, study designs and meta-analysis.  Statistical modelling for continuous and binary data.  Use of a statistics package, such as SAS, to analyze case studies will be important throughout.  This is open only to students registered in the Masters of Health Informatics plan.","academic_level":"graduate","prerequisites":["STAT231"]},{"course_id":"010554","subject":"STAT","catalog_number":"690","title":"Literature and Research Studies","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"014953","subject":"STAT","catalog_number":"814","title":"Systematic Review and Meta-Analysis","units":0.5,"description":"This course will provide students with an overview of the rationale and stages involved in the conduct of a formal systematic review and meta-analysis of a well-defined clinical/health research question. The overarching aim is to provide students with the tools to critically appraise and conduct a systematic review and meta-analysis.  Students will largely work in pairs to progress through each step involved (with feedback from instructors at each stage) and to produce a final systematic review and meta-analysis to be presented/submitted at the end of the course.  \r\nCourse Objectives:\r\n1.  To demonstrate an understanding of the rationale underlying a systematic review and meta-analysis and relevance to clinical care and health policy;\r\n2.  To critically appraise a systematic review;\r\n3.  To develop a focused research question amenable to a systematic review;\r\n4.  To develop and implement a comprehensive and systematic literature search strategy;\r\n5.  To determine and apply procedures for including/excluding potential studies for a systematic review and meta-analysis;\r\n6.  To develop and implement a data abstraction process and study database;\r\n7.  To demonstrate an understanding of the fundamental statistical/biostatistical issues relevant to the conduct of a formal systematic review and meta-analysis.\r\n8.  To perform statistical analyses for a systematic review and meta-analysis and complete/present a final report demonstrating all stages involved.\r\n\r\nStudents will need to meet with Course Coordinators and provide of appropriate previous experience with linear and/or logistic regression techniques.","academic_level":"graduate"},{"course_id":"010065","subject":"STAT","catalog_number":"830","title":"Experimental Design","units":0.5,"description":"Review of experimental designs in a regression setting; analysis of variance; replication, balance, blocking, randomization, and interaction; one-way layout, two-way layout, and Latin square as special cases; factorial structure of treatments; covariates; treatment contrasts; two-level fractional factorial designs; fixed versus random effects; split-plot and repeated-measures designs; other topics.","academic_level":"graduate"},{"course_id":"003087","subject":"STAT","catalog_number":"831","title":"Generalized  Linear Models and Applications","units":0.5,"description":"Review of normal linear regression and maximum likelihood estimation. Computational methods, including Newton-Raphson and iteratively reweighted least squares. Binomial regression; the role of the link function. Goodness-of-fit, goodness-of-link, leverage. Poisson regression models. Generalized linear models. Other topics in regression modelling.","academic_level":"graduate"},{"course_id":"003088","subject":"STAT","catalog_number":"833","title":"Stochastic Processes","units":0.5,"description":"Random walks, renewal theory and processes and their application, Markov chains, branching processes, statistical inference for Markov chains.","academic_level":"graduate"},{"course_id":"003089","subject":"STAT","catalog_number":"835","title":"Statistical Methods for Process Improvement","units":0.5,"description":"Statistical methods for improving processes based on observational data. Assessment of measurement systems. Strategies for variation reduction. Process monitoring, control and adjustment. Clue generation techniques for determining the sources of variability. Variation transmission.","academic_level":"graduate"},{"course_id":"014078","subject":"STAT","catalog_number":"836","title":"Introduction to the Analysis of Spatial Data in Health Research","units":0.5,"description":"The objective of this course is to develop understanding and working knowledge of spatial models and analysis of spatial data.  The course provides an introduction to the rudiments of statistaical inference based on spatially correlated data.  Methods of estimation and testing will be developed for geostatistical models based on variograms and spatial autoregressive models.  Concepts and application of methods will be emphasized through case studies and projects with health applications.","academic_level":"graduate","prerequisites":[1,"STAT431","STAT831"]},{"course_id":"014081","subject":"STAT","catalog_number":"837","title":"Analysis of Longitudinal Data in Health Research","units":0.5,"description":"This course will provide an introduction to principles and methods for the analysis of longitudinal data.  Conditional and random effect of modeling approaches to regression analysis will be covered, as well as semiparametric methods based on generalized estimating equations.  The importance of model assessment and parameter interpretation will be emphasized.  Problems will be motivated by applications in epidemiology, clinical medicine, health services research, and disease natural history studies.  Students will be required to think critically about appropriate strategies for data analysis.  Analysis will be carried out with appropriate statistical software.","academic_level":"graduate","prerequisites":[1,"STAT431","STAT831"]},{"course_id":"003090","subject":"STAT","catalog_number":"840","title":"Computational Inference","units":0.5,"description":"Introduction to and application of computational methods in statistical inference.  Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques including EM.  Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods.","academic_level":"graduate"},{"course_id":"003091","subject":"STAT","catalog_number":"841","title":"Statistical Learning - Classification","units":0.5,"description":"Given known group membership, methods which learn from data how to classify objects into the groups are treated.  Review of likelihood and posterior based discrimination.  Main topics include logistic regression, neural networks, tree-based methods and nearest neighbour methods.  Model assessment, training and tuning.","academic_level":"graduate"},{"course_id":"012612","subject":"STAT","catalog_number":"842","title":"Data Visualization","units":0.5,"description":"Visualization of high dimensional data including interactive methods directed at exploration and assessment of structure and dependencies in data.  Methods for finding groups in data including traditional and modern methods of cluster analysis.  Dimension reduction methods including multi-dimensional scaling, nonlinear and other methods.","academic_level":"graduate"},{"course_id":"003092","subject":"STAT","catalog_number":"844","title":"Statistical Learning - Function Estimation","units":0.5,"description":"Methods for finding surfaces in high dimensions from incomplete or noisy functional information.  Both data adaptive and methods based on fixed parametric structure will be treated.  Model assessment, training and tuning.","academic_level":"graduate"},{"course_id":"011270","subject":"STAT","catalog_number":"846","title":"Mathematical Models in Finance","units":0.5,"description":"Mathematical techniques used to price and hedge derivative securities in modern finance. Modelling, analysis and computations for financial derivative products, including exotic options and swaps in all asset classes. Applications of erivatives in practice.","academic_level":"graduate"},{"course_id":"003094","subject":"STAT","catalog_number":"850","title":"Estimation and Hypothesis Testing","units":0.5,"description":"Discussion of inference problems under the headings of hypothesis testing and point and interval estimation. Frequentist and Bayesian approaches to inference. Construction and evaluation of tests and estimators. Large sample theory of point estimation.","academic_level":"graduate"},{"course_id":"003097","subject":"STAT","catalog_number":"854","title":"Sampling Theory and Practice","units":0.5,"description":"Sources of survey error. Probability sampling designs, estimation and efficiency comparisons. Distribution theory and confidence intervals. Generalized regression estimation. Software for survey analysis.","academic_level":"graduate"},{"course_id":"010555","subject":"STAT","catalog_number":"890","title":"Topics in Statistics","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"010556","subject":"STAT","catalog_number":"891","title":"Topics in Probability","units":0.5,"description":"","academic_level":"graduate"},{"course_id":"003101","subject":"STAT","catalog_number":"901","title":"Theory of Probability 1","units":0.5,"description":"Probability measures, random variables as measurable functions, expectation, independence, characteristic functions, limit theorems, applications.","academic_level":"graduate"},{"course_id":"003102","subject":"STAT","catalog_number":"902","title":"Theory of Probability 2","units":0.5,"description":"Review of conditioning on sigma-fields; martingale theory (discrete and continuous-time) and applications; counting processes; Brownian motion; stochastic differential and integral equations and applications; general theory of Markov processes (including martingale problems and semigroup theory), diffusions; weak convergence of stochastic processes on function spaces; functional versions of the central limit theorem and strong laws; convergence of empirical processes.","academic_level":"graduate"},{"course_id":"003104","subject":"STAT","catalog_number":"906","title":"Computer Intensive Methods for Stochastic Models in Finance","units":0.5,"description":"Review of basic numerical methods. Simulation of random variables, stochastic processes and stochastic models in finance. Numerical solution of deterministic and stochastic differential equations. Valuation of complex financial instruments and derivative securities. Project and paper.","academic_level":"graduate"},{"course_id":"003105","subject":"STAT","catalog_number":"908","title":"Statistical Inference","units":0.5,"description":"Principles of Inference: sufficiency, conditionality, and likelihood; examples and counter examples; conditional inference and ancillarity. Theory of Hypothesis Testing: Neyman-Pearson lemma; similar tests; invariant tests. Asymptotic Theory: maximum likelihood and related theory; large-sample properties of parametric significance tests. Interval Estimation: confidence intervals and significance intervals; location and scale models, conditional intervals. Introduction to Decision Theory: loss and risk functions, admissibility; minimax and Bayes rules; prior and posterior analysis. The course content of Stat 850 is a presumed prerequisite for Stat 908.","academic_level":"graduate"},{"course_id":"003113","subject":"STAT","catalog_number":"923","title":"Multivariate Analysis","units":0.5,"description":"Multivariate problems as extensions of univariate problems, discriminant analysis, canonical correlation and principle component analysis.","academic_level":"graduate"},{"course_id":"003116","subject":"STAT","catalog_number":"929","title":"Time Series 1","units":0.5,"description":"Iterative model building. ARIMA models, application to forecasting, seasonal models, applications.","academic_level":"graduate"},{"course_id":"003117","subject":"STAT","catalog_number":"930","title":"Time Series 2","units":0.5,"description":"Multiple time series modeling including transfer function and intervention analysis. Various special topics in time series such as outliers, robustness, order determination methods, Kalman filtering, sampling and aggregation, seasonal adjustments.","academic_level":"graduate"},{"course_id":"014341","subject":"STAT","catalog_number":"931","title":"Statistical Methods for the Design and Analysis of Epidemiological Studies","units":0.5,"description":"This course covers a wide range of topics pertaining to the design and statistical analysis of observational health studies.  The course is divided into three areas:\r\n1) classical epidemiological study designs including cross-sectional, cohort, population and family-based case-control studies, and issues related to selection of controls;\r\n2) advanced epidemiological study designs including case-cohort, nested case-control, and multiphase sampling designs;\r\n3) causal inference using propensity scores with matching, stratification and regression adjustments, marginal structural models, and instrumental variables.  \r\nStudies will be discussed from the epidemiological literature and other sources in the public domain.  Simulations and data analyses will be carried out using software (e.g. R or SAS).  Students will be trained and assessed in part based on the preparation of reports and delivery of presentations.","academic_level":"graduate"},{"course_id":"014342","subject":"STAT","catalog_number":"932","title":"Statistical Methods for the Design and Analysis of Randomized Intervention Trials","units":0.5,"description":"This course covers topics relevant for the design, conduct and analysis of clinical intervention trials.  The statistical theory behind the methodology as well as practical issues will be discussed.  The course is divided into three areas:\r\n1) important methods for the design of randomized controlled trials including randomization techniques, sample size and power calculations, factorial designs, crossover designs, cluster-randomized trials, non-inferiority trials, adaptive designs, group sequential trials, and ethical issues in design and conduct of clinical trials; \r\n2) topics of predictive modeling including ROC curves, explained variation, and biomarker analyses;\r\n3) dealing with missing data in randomized trials through imputation and inverse weighting, missing covariates, non-compliance, contamination, unplanned crossover, and surrogate outcomes.  \r\nClinical trials from the medical literature and other sources in the public domain will be used as case studies for illustration.  Simulations and data analyses will be carried out using statistical software (e.g. R or SAS).  Students will be trained and assessed in part based on the preparation of reports and delivery of presentations.","academic_level":"graduate"},{"course_id":"003120","subject":"STAT","catalog_number":"935","title":"Analysis of Survival Data","units":0.5,"description":"This course deals with methods of analyzing data on the time to failure with particular emphasis on the use of regression models for such data. Both parameteric and semi-parametric regression models will be considered.","academic_level":"graduate"},{"course_id":"013084","subject":"STAT","catalog_number":"936","title":"Longitudinal Data Analysis","units":0.5,"description":"This course is designed to teach students the appropriate techniques for analyzing data that is collected over time.  This data could arise from biomedical, population public health studies as well as finance and actuarial science applications.  The course will teach how to recognize the added complexity of longitudinal data versus the univariate response data which is typically seen in introductory and generalized linear model courses.  The course emphasizes the importance of the covariance structure for longitudinal responses.  The students will study the difference between subject-specific and population-averaged models and how to recognize problems where one or the other approach might be more appropriate.  They will be expected to use statistical software in applications in order to analyze longitudinal data.","academic_level":"graduate","prerequisites":[[1,"STAT431","STAT831"],"STAT330"]},{"course_id":"003121","subject":"STAT","catalog_number":"937","title":"Introduction  to Biostatistics and Epidemiology","units":0.5,"description":"Design of medical studies including cohort designs, case-control studies and clinical trials. Measures of association in epidemiological studies. Analysis of data from cohort studies, clinical trials and case-control studies. Other topics such as multiplicity in clinical trials, group randomized designs, sequential and group sequential procedures as time permits. Use of a statistical package (e.g. SAS or S-Plus) to analyze medical data.","academic_level":"graduate"},{"course_id":"003122","subject":"STAT","catalog_number":"938","title":"Statistical Consulting","units":0.5,"description":"This course will cover some of the basic tools of a statistical consultant. Topics will include the use of statistical packages, problem-solving techniques, discussion of common statistical consulting problems, effective communication of statistical concepts and management of consulting sessions.","academic_level":"graduate"},{"course_id":"010557","subject":"STAT","catalog_number":"946","title":"Topics in Probability and Statistics","units":0.5,"description":"Topics of current interest","academic_level":"graduate"},{"course_id":"010558","subject":"STAT","catalog_number":"947","title":"Topics in Biostatistics","units":0.5,"description":"Topics of current interest","academic_level":"graduate"},{"course_id":"014063","subject":"STAT","catalog_number":"974","title":"Financial Econometrics","units":0.5,"description":"The focus of this course is on the statistical modelling, estimation and inference and forecasting of nonlinear financial time series, with a special emphasis on volatility and correlation of asset prices and returns.  Topics to be covered normally include: review on distribution and dynamic behaviour of financial time series, univariate and multivariate GARCH processes, long-memory time-series processes, stochastic volatility models, modelling of extreme values, copulas, realized volatility and correlation modelling for ultra high frequency data and continuous time models.","academic_level":"graduate"}]